[
  {
    "id": 1,
    "title": "Samosa",
    "description": "Samosa is a popular Indian snack that features a crispy, golden-brown pastry filled with a spiced mixture of mashed potatoes, peas, and sometimes meat. It's deep-fried to perfection, resulting in a delightful combination of crunchy exterior and flavorful interior.",
    "ingredients": [
      "2 cups boiled and mashed potatoes",
      "1/2 cup boiled peas",
      "1 teaspoon cumin seeds",
      "1 teaspoon garam masala",
      "1 teaspoon coriander powder",
      "1/2 teaspoon turmeric powder",
      "1 teaspoon ginger-garlic paste",
      "Chopped coriander leaves",
      "Salt to taste",
      "Spring roll or samosa wrappers",
      "Oil for frying"
    ],
    "instructions": [
      "In a pan, heat oil and add cumin seeds. Once they splutter, add ginger-garlic paste.",
      "Add mashed potatoes, boiled peas, and all the spices. Mix well and cook for a few minutes.",
      "Allow the filling to cool. Take samosa wrappers and form cones, fill with the potato mixture.",
      "Seal the edges and deep-fry until golden brown.",
      "Serve hot with mint chutney or tamarind sauce."
    ],
    "image": "https://images.unsplash.com/photo-1601050690597-df0568f70950?q=80&w=2940&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
  },
  {
    "id": 2,
    "title": "Chole Bhature",
    "description": "Chole Bhature is a classic North Indian dish consisting of spicy chickpeas (chole) served with deep-fried bread (bhature). The chickpeas are cooked in a flavorful tomato-based curry, while the bhature are soft and fluffy deep-fried bread that complements the spiciness of the chole.",
    "ingredients": [
      "2 cups chickpeas (soaked and boiled)",
      "1 cup finely chopped onions",
      "1 cup tomato puree",
      "1 tablespoon ginger-garlic paste",
      "1 teaspoon cumin seeds",
      "1 teaspoon coriander powder",
      "1/2 teaspoon turmeric powder",
      "1 teaspoon garam masala",
      "Chopped coriander leaves",
      "Salt to taste",
      "For Bhature: 2 cups all-purpose flour, 1 cup yogurt, 1 teaspoon baking powder, Salt, Oil for frying"
    ],
    "instructions": [
      "In a pan, heat oil and add cumin seeds. Add chopped onions and sauté until golden brown.",
      "Add ginger-garlic paste, tomato puree, and all the spices. Cook until the oil separates.",
      "Add boiled chickpeas and simmer until the curry thickens.",
      "For Bhature: Mix all-purpose flour, yogurt, baking powder, and salt to form a soft dough. Allow it to rest.",
      "Roll the dough into small balls and deep-fry until puffed and golden.",
      "Serve Chole with Bhature, garnished with chopped coriander leaves."
    ],
    "image": "https://images.unsplash.com/photo-1596450512748-2dae774fc38a?q=80&w=2795&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
  }
]